{
  "Confidence": {
    "10-20": "You're just beginning to step into your power. It's okay to feel unsure—confidence is built one brave choice at a time.",
    "30-40": "You’ve got glimpses of belief in yourself, but doubt tags along. Try celebrating even the smallest wins—they count more than you think.",
    "50-60": "You carry confidence when you're in your element. Now’s the time to stretch—take that next step even if it feels uncomfortable.",
    "70-80": "You’re standing tall! Your energy shows, and it pushes you forward. Keep riding this wave—challenge is your friend.",
    "90-100": "You walk into rooms like you belong there—and you do. Be the mirror that shows others their potential, too."
  },
  "Humor": {
    "10-20": "You don’t always crack the jokes, but you notice the subtle things. Humor doesn’t have to be loud—it just needs to be real.",
    "30-40": "Your sense of humor is warm and soft-spoken. Let yourself laugh more freely; people connect through shared joy.",
    "50-60": "You’re witty when the vibe’s right. Try tossing a playful comment now and then—your light can brighten any space.",
    "70-80": "Your humor is magnetic. You lift people’s moods just by being you—keep that spark alive.",
    "90-100": "You’re the one people look for in the group chat. Your laugh is contagious, your timing on point—keep being the joy in the room."
  },
  "Creativity": {
    "10-20": "Your imagination is quietly waiting. Pick up something new—draw, write, build—and let your mind roam free.",
    "30-40": "Ideas pop in and out for you. Start collecting them—your next project could begin with a single random thought.",
    "50-60": "You create best when something sparks you. Try giving your creativity more room to play—it’s got a lot to say.",
    "70-80": "Your mind is a fountain of ideas. Share it. Collaborate. Stretch it even further—you’re already on fire.",
    "90-100": "You don’t just imagine—you build. Inspire others by showing that creativity is more than talent—it’s a lifestyle."
  },
  "Intelligence": {
    "10-20": "You’re growing. Curiosity is your best friend—keep asking questions, no matter how small.",
    "30-40": "You understand the basics well. Expand your reach—read something new, explore an unfamiliar idea.",
    "50-60": "You think deeply when it matters. Don’t stop challenging yourself—your brain thrives when tested.",
    "70-80": "You don’t just know—you understand. Let that intelligence shine, especially when others need clarity.",
    "90-100": "You’re the one people turn to for insight. Use your mind to build, guide, and change the game."
  },
  "Kindness": {
    "10-20": "You're beginning to understand how powerful a kind act can be. Even a smile can change someone’s day.",
    "30-40": "You try to be kind, and that effort matters. Start noticing the people who might need that extra care.",
    "50-60": "You’re thoughtful and present. Keep being the safe space people can trust.",
    "70-80": "You radiate warmth and empathy. Let that energy guide others to do the same.",
    "90-100": "You move through life with heart. The world needs more of your kind—be the example, be the light."
  },
  "Patience": {
    "10-20": "Waiting is hard for you. But remember: growth happens quietly, in the background.",
    "30-40": "You’re starting to slow down and breathe. The journey matters just as much as the result.",
    "50-60": "You’re calm when things don’t go your way. That’s rare—keep developing it.",
    "70-80": "You can hold space for people and situations. That’s strength, not weakness.",
    "90-100": "Your patience is a gift. Use it to guide others through chaos with grace."
  },
  "Courage": {
    "10-20": "Fear still wins sometimes—but you’ve got the spark. Start small, and you’ll feel the shift.",
    "30-40": "You’ve faced some things. Push yourself again—you’re stronger than your hesitation.",
    "50-60": "You know how to rise when needed. Start choosing bravery before comfort, and you’ll transform.",
    "70-80": "You inspire people just by doing what scares you. Keep telling your story—others need it.",
    "90-100": "You’re the storm before the calm. Your bravery sets things in motion. Be proud of that."
  },
  "Loyalty": {
    "10-20": "You’re learning who deserves your trust. Loyalty is earned and nurtured—don’t rush it.",
    "30-40": "You care deeply about those close to you. Strengthen those bonds and be there when it counts.",
    "50-60": "You show up when it matters. Your word means something—keep living by it.",
    "70-80": "People know they can count on you. That’s rare. Treasure it.",
    "90-100": "You’re someone’s anchor. Teach others what it means to truly stand by someone."
  },
  "Anger": {
    "10-20": "You rarely express anger. But silence doesn’t always mean peace—learn to speak when needed.",
    "30-40": "You manage anger quietly. Find healthy outlets—it’s okay to feel and express.",
    "50-60": "You walk the line between control and expression. Channel that fire into something meaningful.",
    "70-80": "You’ve learned how to use anger as fuel. Help others do the same—it’s a gift when managed well.",
    "90-100": "Your fire changes things. You don’t just burn—you forge. Lead others with strength and compassion."
  },
  "Ambition": {
    "10-20": "You’ve got a dream—you just haven’t acted yet. Take one step. Then another.",
    "30-40": "You want more. Start mapping it out—your drive needs direction to thrive.",
    "50-60": "You’ve got goals and you’re moving. Don’t settle. There’s more in you.",
    "70-80": "You’re chasing greatness with your eyes wide open. Keep going. People are watching and learning.",
    "90-100": "You’re not just ambitious—you’re unstoppable. The bar you’re setting could change lives."
  }
}
